.config/doom/config.org
#+title: Config
#+property: header-args :tangle config.el

* Table Of Contents :toc:
- [[#window-management][Window Management]]
  - [[#rotate-windows][Rotate windows]]
  - [[#custom-windows-navigation][Custom windows navigation]]
  - [[#create-vertical-window][Create vertical window]]
  - [[#close-the-window][Close the window]]
- [[#theme][Theme]]
- [[#bookmarks-and-ibuffer-mode][Bookmarks and Ibuffer mode]]
  - [[#bookmarks][Bookmarks]]
  - [[#global-auto-revert][Global auto revert]]
  - [[#ibuffer-mode-keybinds][Ibuffer mode keybinds]]
- [[#fonts][Fonts]]
- [[#mardown][Mardown]]
- [[#open-specific-file-examples][Open specific file examples]]
- [[#style-formatting][Style formatting]]
  - [[#bold-surround-automation][Bold surround automation]]
  - [[#italic-surround-automation][Italic surround automation]]
  - [[#green-color-automation][Green color automation]]
- [[#org-mode][Org mode]]
  - [[#org-modern][Org modern]]
  - [[#org-buffer-creation][Org buffer creation]]
  - [[#org-super-agenda][Org Super-agenda]]
  - [[#org-agenda][Org-agenda]]
  - [[#extra-functionality---zero-width-spaces][Extra functionality - zero-width spaces]]
  - [[#easier-file-links][Easier file links]]
  - [[#org-auto-tangle][Org-auto-tangle]]
  - [[#transclusion][Transclusion]]
  - [[#importing-with-pandoc][Importing with Pandoc]]
  - [[#emojis][Emojis]]
  - [[#org-fonts][Org fonts]]
  - [[#org-export][Org-export]]
  - [[#org-journal][Org-journal]]
  - [[#org-roam][Org-roam]]
- [[#perspective][Perspective]]
- [[#rainbow-mode][Rainbow-mode]]
- [[#modeline][Modeline]]
  - [[#file-encoding][File encoding]]
- [[#better-defaults][Better Defaults]]
  - [[#line-settings][Line settings]]
  - [[#abbrev-mode][Abbrev mode]]
  - [[#evil-mode][Evil mode]]
  - [[#consult][Consult]]
  - [[#company][Company]]
  - [[#marginalia][Marginalia]]
- [[#registers][Registers]]
- [[#splits][Splits]]

* Window Management
** Rotate windows
#+begin_src emacs-lisp
(map! :map evil-window-map "SPC" #'rotate-layout
      ;; Navigation
      "<left>"     #'evil-window-left
      "<down>"     #'evil-window-down
      "<up>"       #'evil-window-up
      "<right>"    #'evil-window-right
      ;; Swapping windows
      "C-<left>"       #'+evil/window-move-left
      "C-<down>"       #'+evil/window-move-down
      "C-<up>"         #'+evil/window-move-up
      "C-<right>"      #'+evil/window-move-right)

#+end_src

** Custom windows navigation
#+begin_src emacs-lisp
;; Disable default keybindings for window switching
(global-set-key (kbd "C-j") nil)

;; Define custom functions to switch to different windows
(defun switch-to-right-window ()
  (interactive)
  (other-window 1))

(defun switch-to-left-window ()
  (interactive)
  (other-window -1))

(defun switch-to-up-window ()
  (interactive)
  (windmove-up))

(defun switch-to-down-window ()
  (interactive)
  (windmove-down))

;; Bind the custom functions to the respective key combinations
(global-set-key (kbd "C-l") 'switch-to-right-window)
(global-set-key (kbd "C-h") 'switch-to-left-window)
(global-set-key (kbd "C-k") 'switch-to-up-window)
#+end_src

** Create vertical window
#+begin_src emacs-lisp
;; Define a custom function to create a new vertical window
(defun create-vertical-window ()
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))

;; Bind the custom function to the new key combination
(global-set-key (kbd "C-S-n") 'create-vertical-window)
#+end_src

** Close the window
#+begin_src emacs-lisp
;; Define a custom function to close the current window
(defun close-current-window ()
  (interactive)
  (delete-window)
  (balance-windows))

;; Bind the custom function to the new key combination
(global-set-key (kbd "C-S-w") 'close-current-window)
(delq! t custom-theme-load-path)
#+end_src

* Theme
Set theme to doom-ayu-mirage and `SPC h t` for theme selection.

#+begin_src emacs-lisp
(setq doom-theme 'doom-ayu-mirage)
;; Commented out bcs doesn't make difference
;;(map! :leader
;;      :desc "Load new theme" "h t" #'counsel-load-theme)
#+end_src

* Bookmarks and Ibuffer mode
** Bookmarks
Bookmarks are somewhat like registers in that they record positions you can jump to.  Unlike registers, they have long names, and they persist automatically from one Emacs session to the next. The prototypical use of bookmarks is to record where you were reading in various files.

#+begin_src emacs-lisp
(setq bookmark-default-file "~/.config/doom/bookmarks")
(map! :leader
      (:prefix ("b". "buffer")
       :desc "List bookmarks"                          "L" #'list-bookmarks
       :desc "Set bookmark"                            "m" #'bookmark-set
       :desc "Delete bookmark"                         "M" #'bookmark-set
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save))
#+end_src

** Global auto revert
Keep buffers synced and up to date with auto revert mode.

#+begin_src emacs-lisp
(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)
#+end_src

** Ibuffer mode keybinds
#+begin_src emacs-lisp
(evil-define-key 'normal ibuffer-mode-map
  (kbd "f c") 'ibuffer-filter-by-content
  (kbd "f d") 'ibuffer-filter-by-directory
  (kbd "f f") 'ibuffer-filter-by-filename
  (kbd "f m") 'ibuffer-filter-by-mode
  (kbd "f n") 'ibuffer-filter-by-name
  (kbd "f x") 'ibuffer-filter-disable
  (kbd "g h") 'ibuffer-do-kill-lines
  (kbd "g H") 'ibuffer-update)
#+end_src

* Fonts
If you or Emacs can't find your font, use 'M-x describe-font' to look them up and use 'SPC h r f' to refresh your font settings.

#+begin_src emacs-lisp
(setq doom-font (font-spec :family "JetBrains Mono" :size 15)
      doom-variable-pitch-font (font-spec :family "JetBrains Mono" :size 15)
      doom-big-font (font-spec :family "JetBrains Mono" :size 24))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+end_src

* Mardown
#+begin_src emacs-lisp
(custom-set-faces
 '(markdown-header-face ((t (:inherit font-lock-function-name-face :weight bold :family "variable-pitch"))))
 '(markdown-header-face-1 ((t (:inherit markdown-header-face :height 1.7))))
 '(markdown-header-face-2 ((t (:inherit markdown-header-face :height 1.6))))
 '(markdown-header-face-3 ((t (:inherit markdown-header-face :height 1.5))))
 '(markdown-header-face-4 ((t (:inherit markdown-header-face :height 1.4))))
 '(markdown-header-face-5 ((t (:inherit markdown-header-face :height 1.3))))
 '(markdown-header-face-6 ((t (:inherit markdown-header-face :height 1.2)))))
#+end_src

* Open specific file examples
The format I use for these bindings is 'SPC e' plus 'key' since Doom Emacs does not use 'SPC e'.

#+begin_src emacs-lisp
(map! :leader
      (:prefix ("e" . "open file")
       :desc "Edit repeaters file"   "r" #'(lambda () (interactive) (find-file "~/.config/doom/repeaters.org"))
       :desc "Edit agenda file"      "a" #'(lambda () (interactive) (find-file "~/documents/Org/agenda.org"))
       :desc "Edit doom config.org"  "c" #'(lambda () (interactive) (find-file "~/.config/doom/config.org"))
       :desc "Edit inbox file"       "i" #'(lambda () (interactive) (find-file "~/.config/Org/inbox.org"))
       :desc "Edit projects file"    "p" #'(lambda () (interactive) (find-file "~/.config/Org/projects.org"))
       :desc "Edit emacs cheatsheet" "s" #'(lambda () (interactive) (find-file "~/workspace/dotfiles/.config/doom/README.org"))))
#+end_src

* Style formatting
This controls the color of bold, italic, underline, verbatim, strikethrough.
#+begin_src emacs-lisp
(after! org
  (setq org-emphasis-alist
  '(("*" (bold :slant italic :weight black ))
    ("/" (italic :foreground "dark salmon" ))
    ("_" (underline :foreground "cyan" ))
    ("=" (:foreground "slate blue" ))
    ("~" (:foreground "dim gray" ))   ;; Other colors could be: snow1, PaleGreen1
    ("+" (:strike-through nil :foreground "PaleGreen1" )))))
#+end_src

** Bold surround automation
This automates the surround for bold style with "m" key in visual mode.
#+begin_src emacs-lisp
;; Define the custom function to surround the word with asteriks.
(defun surround-with-bold ()
  (interactive)
  (when (evil-visual-state-p) ;; Enter visual mode
    (let ((region-start (region-beginning))
          (region-end (region-end)))
    (goto-char region-end)
    (insert "*")
    (goto-char region-start)
    (insert "*"))))

;; Map the custom function to "m" key while in visual mode
(eval-after-load 'org
     (define-key evil-visual-state-map (kbd "m") 'surround-with-bold))
#+end_src

** Italic surround automation
#+begin_src emacs-lisp
;; Define the custom function to surround the word with slashes.
(defun surround-with-italic ()
  (interactive)
  (when (evil-visual-state-p) ;; Enter visual mode
    (let ((region-start (region-beginning))
          (region-end (region-end)))
    (goto-char region-end)
    (insert "/")
    (goto-char region-start)
    (insert "/"))))

;; Map the custom function to "/" key while in visual mode
(define-key evil-visual-state-map (kbd "/") 'surround-with-italic)
#+end_src

** Green color automation
#+begin_src emacs-lisp
;; Define the custom function to surround the word with pluses.
(defun surround-with-green ()
  (interactive)
  (when (evil-visual-state-p) ;; Enter visual mode
    (let ((region-start (region-beginning))
          (region-end (region-end)))
    (goto-char region-end)
    (insert "+")
    (goto-char region-start)
    (insert "+"))))

;; Map the custom function to "." key while in visual mode
(define-key evil-visual-state-map (kbd ".") 'surround-with-green)
#+end_src

* Org mode
